## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-07-25T00:45:43Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:507252742351:s50ry4jhg5/" -> (known after apply)
      ~ id                = "pzy8zx" -> (known after apply)
      ~ invoke_url        = "https://s50ry4jhg5.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      + stage_description = "4b3271cd25d4390fbcb1dbee74fb1b0c" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
      ~ deployment_id         = "t6kz7x" -> (known after apply)
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>